TASKS = {
    "math": [
        {"id": "m1", "q": "Решите уравнение sqrt(x+3) = x - 1. Если корней несколько, в ответе укажите их сумму.", "o": ["-1", "2", "3", "1"], "a": 1, "e": "ОДЗ: x+3 >= 0 и x-1 >= 0 => x >= 1. Возводим в квадрат: x+3 = (x-1)^2 => x+3 = x^2 - 2x + 1 => x^2 - 3x - 2 = 0 => x = 2 или x = -1. x = -1 не подходит по ОДЗ. Ответ: 2.", "t": "Уравнения", "d": 2},
        {"id": "m2", "q": "Вычислите значение выражения: log2(8) + log3(9) - log5(25)", "o": ["2", "3", "4", "5"], "a": 2, "e": "log2(8) = 3 (т.к. 2^3=8), log3(9) = 2 (3^2=9), log5(25) = 2 (5^2=25). Итого: 3+2-2 = 3.", "t": "Логарифмы", "d": 1},
        {"id": "m3", "q": "На отрезке [0; pi] решите уравнение sin(2x) = 1/2. Укажите количество корней.", "o": ["1", "2", "3", "4"], "a": 1, "e": "2x = pi/6 + 2pi*k или 2x = 5pi/6 + 2pi*k. x = pi/12 + pi*k или x = 5pi/12 + pi*k. На [0; pi]: x = pi/12, x = 5pi/12. Два корня.", "t": "Тригонометрия", "d": 3},
        {"id": "m4", "q": "Найдите значение производной функции f(x) = x^3 * ln(x) в точке x = 1.", "o": ["0", "1", "2", "3"], "a": 1, "e": "f'(x) = 3x^2*ln(x) + x^3*(1/x) = 3x^2*ln(x) + x^2. f'(1) = 3*1*0 + 1 = 1.", "t": "Производная", "d": 3},
        {"id": "m5", "q": "Бросают две игральные кости. Найдите вероятность того, что сумма выпавших очков больше 8.", "o": ["5/18", "7/36", "5/36", "1/6"], "a": 0, "e": "Всего исходов: 6*6=36. Благоприятные: (3,6),(4,5),(4,6),(5,4),(5,5),(5,6),(6,3),(6,4),(6,5),(6,6) - 10 исходов. P = 10/36 = 5/18.", "t": "Вероятность", "d": 2},
        {"id": "m6", "q": "В треугольнике ABC угол C = 90°, AB = 10, AC = 6. Найдите sin B.", "o": ["0.6", "0.8", "0.75", "0.5"], "a": 0, "e": "BC = sqrt(AB^2 - AC^2) = sqrt(100-36) = 8. sin B = AC/AB = 6/10 = 0.6.", "t": "Планиметрия", "d": 2},
        {"id": "m7", "q": "Высота цилиндра равна 5, радиус основания равен 3. Найдите объем цилиндра.", "o": ["15pi", "30pi", "45pi", "75pi"], "a": 2, "e": "V = pi*R^2*h = pi*9*5 = 45pi.", "t": "Стереометрия", "d": 1},
        {"id": "m8", "q": "Решите неравенство: 2^x + 2^(x-1) < 12. В ответе укажите наибольшее целое решение.", "o": ["1", "2", "3", "4"], "a": 2, "e": "2^x + 2^x/2 < 12 => (3/2)*2^x < 12 => 2^x < 8 => x < 3. Наибольшее целое: x = 2.", "t": "Неравенства", "d": 2},
        {"id": "m9", "q": "Теплоход проходит по течению от A до B за 4 часа, против течения - за 6 часов. За сколько часов проплывет это расстояние плот?", "o": ["12", "18", "24", "10"], "a": 2, "e": "v_тепл + v_теч = S/4, v_тепл - v_теч = S/6. Вычитаем: 2v_теч = S/4 - S/6 = S/12 => v_теч = S/24. Время плота = S/v_теч = 24 часа.", "t": "Текстовые задачи", "d": 3},
        {"id": "m10", "q": "При каких значениях a уравнение |x^2 - 4| = a имеет ровно 3 корня?", "o": ["a=4", "a=0", "a=2", "a=3"], "a": 0, "e": "График y = |x^2-4|. При a=4 прямая y=4 пересекает его в 3 точках: x=-2, x=0, x=2.", "t": "Параметры", "d": 4},
    ],
    "russian": [
        {"id": "r1", "q": "В каком ряду во всех словах пропущена чередующаяся гласная корня?", "o": ["предл_гать, выр_сли, к_саться", "зат_рать, к_рзина, зап_реть", "б_рюза, выт_рать, изл_жение", "г_ревать, с_рняк, к_сательная"], "a": 0, "e": "В варианте 1 все слова с чередованием: лаг/лож, раст/рос, кас/кос.", "t": "Орфография", "d": 2},
        {"id": "r2", "q": "В каком слове НЕВЕРНО поставлено ударение?", "o": ["звонИт", "тОрты", "красИвее", "катАлог"], "a": 3, "e": "Правильно: каталОг, ударение на последний слог.", "t": "Орфоэпия", "d": 1},
        {"id": "r3", "q": "В каком предложении вместо слова ОДЕТЬ нужно употребить НАДЕТЬ?", "o": ["Мама одела ребенка в теплый комбинезон.", "Он одел шляпу и вышел на улицу.", "Медсестра одела пациента.", "Одень куклу в платье."], "a": 1, "e": "ОДЕТЬ можно кого-то, НАДЕТЬ - что-то на себя. Шляпу надо НАДЕТЬ.", "t": "Лексические нормы", "d": 1},
        {"id": "r4", "q": "Укажите предложение с грамматической ошибкой.", "o": ["Благодаря усилиям команды проект был завершен.", "Согласно приказа директора все вернулись.", "Вопреки предсказаниям погода улучшилась.", "По окончании школы он поступил в университет."], "a": 1, "e": "Правильно: Согласно прикаЗУ директора (дат. падеж, не род.).", "t": "Грамматические нормы", "d": 2},
        {"id": "r5", "q": "Укажите правильное объяснение постановки запятой: 'Солнце уже скрылось (?) и в комнате стало темно.'", "o": ["Запятая не нужна, т.к. союз И соединяет однородные", "Запятая нужна, т.к. это сложное предложение", "Запятая не нужна, т.к. есть общий член", "Запятая нужна, т.к. союз И повторяется"], "a": 1, "e": "Это сложносочиненное предложение с двумя грамматическими основами (солнце скрылось, стало темно), поэтому запятая нужна.", "t": "Пунктуация", "d": 2},
        {"id": "r6", "q": "Какое средство выразительности использовано: 'Горит восток зарею новой'?", "o": ["Метафора", "Эпитет", "Сравнение", "Олицетворение"], "a": 0, "e": "Метафора - скрытое сравнение, 'горит восток' - восток освещен, как огнем.", "t": "Выразительность", "d": 2},
        {"id": "r7", "q": "Укажите словосочетание с типом связи ПРИМЫКАНИЕ.", "o": ["зеленый лес", "бежать быстро", "дом из кирпича", "любить родителей"], "a": 1, "e": "Примыкание - зависимое слово неизменяемое (наречие, деепричастие). 'Бежать быстро' - глагол + наречие.", "t": "Синтаксис", "d": 2},
        {"id": "r8", "q": "В каком варианте НЕ со словом пишется СЛИТНО?", "o": ["(не)смотря на усталость", "еще (не)прочитанная книга", "(не)сделал задание", "говорил (не)громко, а тихо"], "a": 0, "e": "'НЕ смотря на' = 'вопреки', пишется слитно. В остальных случаях раздельно или есть противопоставление.", "t": "Орфография", "d": 3},
    ],
    "physics": [
        {"id": "p1", "q": "Тело движется равноускоренно из состояния покоя. За 4 секунды оно прошло 32 м. Найдите ускорение тела.", "o": ["2 м/с^2", "4 м/с^2", "8 м/с^2", "16 м/с^2"], "a": 1, "e": "S = at^2/2 => a = 2S/t^2 = 64/16 = 4 м/с^2.", "t": "Кинематика", "d": 1},
        {"id": "p2", "q": "Тело массой 2 кг движется по окружности радиусом 0.5 м со скоростью 3 м/с. Найдите центростремительную силу.", "o": ["9 Н", "18 Н", "36 Н", "6 Н"], "a": 2, "e": "F = mv^2/R = 2*9/0.5 = 36 Н.", "t": "Динамика", "d": 1},
        {"id": "p3", "q": "Тепловой двигатель получает от нагревателя 500 Дж теплоты и отдает холодильнику 300 Дж. Найдите КПД двигателя.", "o": ["20%", "40%", "60%", "80%"], "a": 1, "e": "КПД = (Qн - Qх)/Qн * 100% = (500-300)/500 * 100% = 40%.", "t": "Термодинамика", "d": 2},
        {"id": "p4", "q": "Через проводник сопротивлением 10 Ом течет ток 2 А. Найдите напряжение на концах проводника.", "o": ["5 В", "10 В", "20 В", "40 В"], "a": 2, "e": "U = I*R = 2*10 = 20 В (закон Ома).", "t": "Электричество", "d": 1},
        {"id": "p5", "q": "Электрон движется в магнитном поле со скоростью 10^6 м/с. Индукция поля 0.01 Тл. Найдите силу Лоренца (e = 1.6*10^-19 Кл).", "o": ["1.6*10^-15 Н", "1.6*10^-17 Н", "3.2*10^-15 Н", "3.2*10^-17 Н"], "a": 0, "e": "F = qvB = 1.6*10^-19 * 10^6 * 0.01 = 1.6*10^-15 Н.", "t": "Магнетизм", "d": 3},
        {"id": "p6", "q": "Период колебаний математического маятника равен 2 с. Найдите его длину (g = 10 м/с^2, pi^2 ≈ 10).", "o": ["0.5 м", "1 м", "2 м", "4 м"], "a": 1, "e": "T = 2pi*sqrt(L/g) => L = g*(T/(2pi))^2 = 10*(2/(2pi))^2 = 10*(1/pi)^2 ≈ 10/10 = 1 м.", "t": "Колебания", "d": 2},
        {"id": "p7", "q": "Свет переходит из воздуха в воду. Показатель преломления воды 1.33. Угол падения 45°, чему примерно равен угол преломления?", "o": ["22°", "32°", "45°", "60°"], "a": 1, "e": "n1*sin(a) = n2*sin(b). 1*sin45 = 1.33*sin(b). sin(b) = 0.707/1.33 ≈ 0.53. b ≈ 32°.", "t": "Оптика", "d": 3},
        {"id": "p8", "q": "Тело массой 2 кг падает с высоты 10 м. Найдите его кинетическую энергию в момент удара о землю (g = 10 м/с^2).", "o": ["50 Дж", "100 Дж", "200 Дж", "400 Дж"], "a": 2, "e": "Потенциальная энергия mgh = 2*10*10 = 200 Дж переходит в кинетическую. Eк = 200 Дж.", "t": "Законы сохранения", "d": 1},
    ],
    "society": [
        {"id": "s1", "q": "Что из перечисленного относится к биологическим потребностям человека?", "o": ["Общение с друзьями", "Потребность в пище", "Получение образования", "Самореализация"], "a": 1, "e": "Биологические потребности - это потребности, связанные с выживанием: еда, вода, сон, дыхание.", "t": "Человек и общество", "d": 1},
        {"id": "s2", "q": "Что из перечисленного является фактором производства?", "o": ["Прибыль", "Заработная плата", "Капитал", "Налоги"], "a": 2, "e": "Факторы производства: труд, земля, капитал, предпринимательские способности, информация.", "t": "Экономика", "d": 1},
        {"id": "s3", "q": "Какая форма правления предполагает передачу власти по наследству?", "o": ["Монархия", "Республика", "Демократия", "Федерация"], "a": 0, "e": "Монархия - форма правления, где власть передается по наследству. Республика предполагает выборность власти.", "t": "Политика", "d": 1},
        {"id": "s4", "q": "Какая отрасль права регулирует отношения между работником и работодателем?", "o": ["Гражданское право", "Трудовое право", "Административное право", "Уголовное право"], "a": 1, "e": "Трудовое право регулирует трудовые отношения: заключение договоров, оплата труда, отпуска.", "t": "Право", "d": 1},
        {"id": "s5", "q": "Верны ли суждения о социальной стратификации: А) Социальная стратификация существует в любом обществе; Б) Критерием стратификации может быть доход.", "o": ["Верно только А", "Верно только Б", "Оба верны", "Оба неверны"], "a": 2, "e": "Оба суждения верны. Стратификация - деление общества на слои, существует везде. Доход - один из критериев.", "t": "Социальные отношения", "d": 2},
        {"id": "s6", "q": "Какой признак характеризует постиндустриальное общество?", "o": ["Преобладание сельского хозяйства", "Развитие промышленности", "Преобладание сферы услуг", "Натуральное хозяйство"], "a": 2, "e": "В постиндустриальном обществе преобладает сфера услуг и информационные технологии.", "t": "Типология обществ", "d": 2},
        {"id": "s7", "q": "К какому виду налогов относится НДС?", "o": ["Прямой налог", "Косвенный налог", "Местный налог", "Прогрессивный налог"], "a": 1, "e": "НДС - косвенный налог, т.к. включается в цену товара и фактически уплачивается потребителем.", "t": "Экономика", "d": 2},
        {"id": "s8", "q": "Что относится к полномочиям Президента РФ?", "o": ["Утверждение бюджета", "Назначение Председателя Правительства", "Принятие законов", "Назначение выборов Президента"], "a": 1, "e": "Президент назначает Председателя Правительства с согласия Госдумы. Бюджет утверждает Дума, законы принимает ФС.", "t": "Политика", "d": 3},
    ],
    "chemistry": [
        {"id": "c1", "q": "Сколько электронов находится на внешнем уровне атома кислорода?", "o": ["2", "4", "6", "8"], "a": 2, "e": "Кислород находится в VI группе, значит на внешнем уровне 6 электронов.", "t": "Строение атома", "d": 1},
        {"id": "c2", "q": "Какая связь в молекуле хлора Cl2?", "o": ["Ионная", "Ковалентная неполярная", "Ковалентная полярная", "Металлическая"], "a": 1, "e": "Cl2 - два атома одного элемента, электроотрицательность одинаковая - связь ковалентная неполярная.", "t": "Химическая связь", "d": 1},
        {"id": "c3", "q": "Какой объем (н.у.) занимает 1 моль углекислого газа CO2?", "o": ["11.2 л", "22.4 л", "33.6 л", "44.8 л"], "a": 1, "e": "1 моль любого газа при н.у. занимает 22.4 л (закон Авогадро).", "t": "Количество вещества", "d": 1},
        {"id": "c4", "q": "Какая среда в растворе хлорида аммония NH4Cl?", "o": ["Нейтральная", "Кислая", "Щелочная", "Зависит от концентрации"], "a": 1, "e": "NH4Cl - соль слабого основания и сильной кислоты. Гидролиз по катиону, среда кислая.", "t": "Гидролиз", "d": 3},
        {"id": "c5", "q": "Какое вещество является изомером бутана?", "o": ["Бутен", "2-метилпропан", "Бутанол", "Циклобутан"], "a": 1, "e": "Изомеры - вещества с одинаковым составом, разным строением. 2-метилпропан (изобутан) - изомер бутана C4H10.", "t": "Органическая химия", "d": 2},
        {"id": "c6", "q": "В каком соединении степень окисления хрома равна +6?", "o": ["Cr2O3", "CrO3", "Cr(OH)3", "Cr2(SO4)3"], "a": 1, "e": "В CrO3 у кислорода -2, значит у хрома +6. В остальных: Cr2O3 (+3), Cr(OH)3 (+3), Cr2(SO4)3 (+3).", "t": "Окислительно-восстановительные реакции", "d": 2},
    ],
    "english": [
        {"id": "e1", "q": "Choose the correct form: 'I ___ to the cinema yesterday.'", "o": ["go", "went", "have gone", "was going"], "a": 1, "e": "С yesterday (вчера) используем Past Simple - went.", "t": "Grammar: Past Simple", "d": 1},
        {"id": "e2", "q": "Fill in the blank: 'If it rains, we ___ stay at home.'", "o": ["will", "would", "are", "do"], "a": 0, "e": "First Conditional: if + Present Simple, will + infinitive.", "t": "Grammar: Conditionals", "d": 2},
        {"id": "e3", "q": "Choose the correct preposition: 'She is interested ___ learning French.'", "o": ["on", "in", "at", "of"], "a": 1, "e": "Устойчивое выражение: interested IN (заинтересован в).", "t": "Grammar: Prepositions", "d": 1},
        {"id": "e4", "q": "What is the synonym of 'BIG'?", "o": ["Small", "Tiny", "Large", "Short"], "a": 2, "e": "Large - большой, синоним к big. Small, tiny - маленькие, short - короткий.", "t": "Vocabulary", "d": 1},
        {"id": "e5", "q": "Choose the correct passive: 'The letter ___ yesterday.'", "o": ["sent", "was sent", "is sent", "has sent"], "a": 1, "e": "Пассивный залог, прошедшее время: was/were + V3. The letter was sent.", "t": "Grammar: Passive Voice", "d": 2},
        {"id": "e6", "q": "Which word is a COUNTABLE noun?", "o": ["Water", "Advice", "Chair", "Information"], "a": 2, "e": "Chair (стул) - исчисляемое (a chair, two chairs). Water, advice, information - неисчисляемые.", "t": "Grammar: Countable/Uncountable", "d": 2},
    ],
    "biology": [
        {"id": "b1", "q": "Какая органелла клетки отвечает за синтез белка?", "o": ["Митохондрия", "Рибосома", "Аппарат Гольджи", "Лизосома"], "a": 1, "e": "Рибосомы - органеллы, отвечающие за синтез белка (трансляцию).", "t": "Цитология", "d": 1},
        {"id": "b2", "q": "Сколько хромосом в половых клетках человека?", "o": ["23", "46", "92", "12"], "a": 0, "e": "Половые клетки (гаметы) содержат гаплоидный набор - 23 хромосомы.", "t": "Генетика", "d": 1},
        {"id": "b3", "q": "Какое растение относится к отделу Голосеменные?", "o": ["Береза", "Сосна", "Папоротник", "Мох"], "a": 1, "e": "Сосна - голосеменное растение (семена лежат открыто на чешуях шишек).", "t": "Ботаника", "d": 1},
        {"id": "b4", "q": "Какой процесс происходит в хлоропластах?", "o": ["Гликолиз", "Фотосинтез", "Трансляция", "Транскрипция"], "a": 1, "e": "Фотосинтез происходит в хлоропластах, содержащих хлорофилл.", "t": "Фотосинтез", "d": 1},
        {"id": "b5", "q": "Какая система органов отвечает за газообмен у человека?", "o": ["Кровеносная", "Дыхательная", "Пищеварительная", "Выделительная"], "a": 1, "e": "Дыхательная система (легкие, бронхи, трахея) обеспечивает газообмен.", "t": "Анатомия", "d": 1},
        {"id": "b6", "q": "Что такое эволюция?", "o": ["Развитие организма от рождения до смерти", "Историческое развитие органического мира", "Изменение погоды", "Рост численности популяции"], "a": 1, "e": "Эволюция - историческое развитие живой природы, процесс изменения видов со временем.", "t": "Эволюция", "d": 2},
    ],
    "history": [
        {"id": "h1", "q": "В каком году произошло Крещение Руси?", "o": ["862 г.", "988 г.", "1054 г.", "1223 г."], "a": 1, "e": "Крещение Руси произошло в 988 году при князе Владимире Святославиче.", "t": "Древняя Русь", "d": 1},
        {"id": "h2", "q": "Кто был первым российским императором?", "o": ["Иван Грозный", "Петр I", "Екатерина II", "Александр I"], "a": 1, "e": "Петр I принял титул императора в 1721 году после Северной войны.", "t": "Российская империя", "d": 1},
        {"id": "h3", "q": "Какое событие произошло в 1812 году?", "o": ["Бородинское сражение", "Куликовская битва", "Полтавская битва", "Ледовое побоище"], "a": 0, "e": "Бородинское сражение - ключевое сражение Отечественной войны 1812 года.", "t": "XIX век", "d": 1},
        {"id": "h4", "q": "В каком году отменили крепостное право в России?", "o": ["1801 г.", "1861 г.", "1917 г.", "1762 г."], "a": 1, "e": "Крепостное право отменено 19 февраля 1861 года при Александре II.", "t": "XIX век", "d": 1},
        {"id": "h5", "q": "Кто руководил СССР в период Великой Отечественной войны?", "o": ["В.И. Ленин", "И.В. Сталин", "Н.С. Хрущев", "Л.И. Брежнев"], "a": 1, "e": "И.В. Сталин был Генеральным секретарем ЦК ВКП(б) в период ВОВ (1941-1945).", "t": "XX век", "d": 1},
        {"id": "h6", "q": "Какое событие положило начало Смутному времени?", "o": ["Смерть Ивана Грозного", "Пресечение династии Рюриковичей", "Восстание Болотникова", "Польская интервенция"], "a": 1, "e": "Смутное время (1598-1613) началось после пресечения династии Рюриковичей со смертью Федора Иоанновича.", "t": "Смутное время", "d": 2},
    ],
    "informatics": [
        {"id": "i1", "q": "Сколько бит в одном байте?", "o": ["4", "8", "16", "32"], "a": 1, "e": "1 байт = 8 бит.", "t": "Измерение информации", "d": 1},
        {"id": "i2", "q": "Какая система счисления используется в компьютере?", "o": ["Десятичная", "Двоичная", "Восьмеричная", "Шестнадцатеричная"], "a": 1, "e": "Компьютер использует двоичную систему счисления (0 и 1).", "t": "Системы счисления", "d": 1},
        {"id": "i3", "q": "Что такое IP-адрес?", "o": ["Адрес веб-сайта", "Уникальный номер устройства в сети", "Пароль для доступа в интернет", "Название браузера"], "a": 1, "e": "IP-адрес - уникальный числовой идентификатор устройства в компьютерной сети.", "t": "Сети", "d": 1},
        {"id": "i4", "q": "Какая структура данных работает по принципу 'последним пришел - первым вышел' (LIFO)?", "o": ["Очередь", "Стек", "Массив", "Список"], "a": 1, "e": "Стек (stack) - структура LIFO. Очередь - FIFO.", "t": "Алгоритмы и структуры данных", "d": 2},
        {"id": "i5", "q": "Чему равно число 1011 в двоичной системе в десятичной?", "o": ["8", "11", "13", "15"], "a": 1, "e": "1011_2 = 1*8 + 0*4 + 1*2 + 1*1 = 8+0+2+1 = 11.", "t": "Системы счисления", "d": 2},
        {"id": "i6", "q": "Какая команда в Python выводит данные на экран?", "o": ["input()", "print()", "return()", "write()"], "a": 1, "e": "Функция print() выводит данные в консоль в Python.", "t": "Программирование", "d": 1},
    ],
}
